Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/waste_management_and_recycling/tax_relief_on_domestic_service_charges.html.txt.tmx
Source language: en
Languages: ga

source: Tax relief on domestic service charges
ga: Faoiseamh cánach ar tháillí seirbhísí baile

source: In the past, tax relief was available if you paid service charges to a local authority or other provider of water, refuse or sewage services
ga: Go dtí le déanaí, bhí faoiseamh cánach ar fáil má íoc tú táillí seirbhísí le húdarás áitiúil nó le soláthraí eile seirbhísí uisce, bruscair nó camrais

source: The relief was granted in each tax year in respect of charges due and paid in the previous year
ga: Tugadh an faoiseamh seo i ngach bliain chánach i leith táillí a íocadh sa bhliain chánach roimhe

source: This tax relief has ended
ga: Tá críoch curtha leis an bhfaoiseamh cánach seo

source: You cannot claim tax relief on service charges paid from 2011 onwards
ga: Níorbh féidir faoiseamh a fháil i leith táillí seirbhísí a íocadh ón bhliain chánach 2011 amach

source: If you have not yet claimed for service charges paid in 2010 or previous years, it is now too late to put in a claim, as this had to be done within 4 years of the end of the relevant tax year
ga: Munar éiligh tú an faoiseamh i leith na bliana 2010 nó i leith aon bhliain roimhe sin, ní féidir anois é a éileamh, mar bhí ort é seo a dhéanamh taobh istigh de thréimhse 4 bliana ón mbliain chuí

source: The charges that you paid for the following services qualified for tax relief:
ga: Bhí na táillí a d'íoc tú ar na seirbhísí seo a leanas incháilithe i gcomhair faoisimh chánach:

source: • Domestic refuse collection, domestic sewage disposal and domestic water supplies provided by your local authority
ga: • Bailiúchán bruscair baile, diúscairt camrais baile agus soláthar uisce baile a chuir d’údarás áitiúil ar fáil

source: • Domestic water supplies provided by group water schemes
ga: • Soláthar uisce baile a chuir grúpscéimeanna uisce ar fáil

source: • Domestic refuse collection by independent contractors
ga: • Bailiúchán bruscair baile a rinne conraitheoir neamhspleách

source: There is more detail (pdf) on revenue.ie
ga: Tá breis eolais (pdf) ar revenue.ie
